In [1]:
import pandas as pd

df = pd.read_csv('data/broadcast.csv', index_col=0, delimiter='\t')
df
# 코드를 작성하세요.

         KBS     MBC     SBS  TV CHOSUN   JTBC  Channel A    MBN
2011  35.951  18.374  11.173      9.102  7.380      3.771  2.809
2012  36.163  16.022  11.408      8.785  7.878      5.874  3.310
2013  31.989  16.778   9.673      9.026  7.810      5.350  3.825
2014  31.210  15.663   9.108      9.440  7.490      5.776  4.572
2015  27.777  16.573   9.099      9.940  7.267      6.678  5.520
2016  27.583  14.982   8.669      9.829  7.727      6.624  5.477
2017  26.890  12.465   8.661      8.886  9.453      6.056  5.215

In [2]:
# 여기서 T는 Transpose의 앞 글자이며, 뒤바뀌다라는 의미를 갖고 있음
df.T

             2011    2012    2013    2014    2015    2016    2017
KBS        35.951  36.163  31.989  31.210  27.777  27.583  26.890
MBC        18.374  16.022  16.778  15.663  16.573  14.982  12.465
SBS        11.173  11.408   9.673   9.108   9.099   8.669   8.661
TV CHOSUN   9.102   8.785   9.026   9.440   9.940   9.829   8.886
JTBC        7.380   7.878   7.810   7.490   7.267   7.727   9.453
Channel A   3.771   5.874   5.350   5.776   6.678   6.624   6.056
MBN         2.809   3.310   3.825   4.572   5.520   5.477   5.215

sbs와 jtbc의 시청률만 보고 싶다면?! 당신의 선택은!?

# \[\[\]\]가 두개 들어 가는 이유는? 
리스트가 안에 삽입 되기 때문임.

In [6]:
df[['SBS','JTBC']]

         SBS   JTBC
2011  11.173  7.380
2012  11.408  7.878
2013   9.673  7.810
2014   9.108  7.490
2015   9.099  7.267
2016   8.669  7.727
2017   8.661  9.453

In [5]:
columns = {'SBS','JTBC'}
df[columns]

         SBS   JTBC
2011  11.173  7.380
2012  11.408  7.878
2013   9.673  7.810
2014   9.108  7.490
2015   9.099  7.267
2016   8.669  7.727
2017   8.661  9.453

## 슬라이스를 사용한 다른 범위

In [7]:
df.loc[: , ['SBS','JTBC']]

         SBS   JTBC
2011  11.173  7.380
2012  11.408  7.878
2013   9.673  7.810
2014   9.108  7.490
2015   9.099  7.267
2016   8.669  7.727
2017   8.661  9.453

### Tip, row와 column의 위치 변경 방법

In [24]:
import pandas as pd

df = pd.read_csv('data/broadcast.csv', index_col=0, delimiter='\t')

sbs_list = df["SBS"]  
jtbc_list = df["JTBC"]

list_of_series = [sbs_list, jtbc_list]
df = pd.DataFrame(list_of_series)

df

        2011    2012   2013   2014   2015   2016   2017
SBS   11.173  11.408  9.673  9.108  9.099  8.669  8.661
JTBC   7.380   7.878  7.810  7.490  7.267  7.727  9.453

In [30]:
df

        2011    2012   2013   2014   2015   2016   2017
SBS   11.173  11.408  9.673  9.108  9.099  8.669  8.661
JTBC   7.380   7.878  7.810  7.490  7.267  7.727  9.453

In [28]:
df.T

         SBS   JTBC
2011  11.173  7.380
2012  11.408  7.878
2013   9.673  7.810
2014   9.108  7.490
2015   9.099  7.267
2016   8.669  7.727
2017   8.661  9.453